<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 4 changes.</summary>

```diff
# module.vm_minimal_config.proxmox_virtual_environment_vm.vm has changed
# module.ubuntu22.module.cloud_image["0"].proxmox_virtual_environment_download_file.image has been deleted
+ tailscale_tailnet_key.tailscale_key will be created
+ module.ubuntu22.proxmox_virtual_environment_vm.vm will be created
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
+ module.ubuntu22.module.cloud_image["0"].proxmox_virtual_environment_download_file.image will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 0 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-16T19:47:33Z [(view log)](https://github.com/perchnet/p/actions/runs/17012251100/job/48229850162#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                  = "134"
      + ipv4_addresses      = []
      + ipv6_addresses      = []
      + mac_addresses       = [
          + "BC:24:11:CC:E9:F2",
        ]
        name                = "vm-debian13-minimal"
        tags                = [
            "terraform",
        ]
        # (25 unchanged attributes hidden)

      ~ disk {
          + path_in_datastore = "vm-134-disk-1"
          ~ size              = 10 -> 8
            # (13 unchanged attributes hidden)
        }
      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "zssd" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-131-disk-0" -> null
          - replicate         = true -> null
          - size              = 1 -> null
          - ssd               = false -> null
            # (3 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.ubuntu22.module.cloud_image["0"].proxmox_virtual_environment_download_file.image has been deleted
  - resource "proxmox_virtual_environment_download_file" "image" {
      - id                  = "zssd-files:import/https://cloud-images.ubuntu.com/releases/22.04/release-20240207/ubuntu-22.04-server-cloudimg-amd64.qcow2" -> null
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Terraform VM created on 2025-08-15T02:28:28Z"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "ubuntu22"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "ubuntu",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 8022

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + import_from       = (known after apply)
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "134" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:CC:E9:F2",
        ] -> (known after apply)
        name                    = "vm-debian13-minimal"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 134 -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-134-disk-1" -> (known after apply)
          ~ size              = 8 -> 10
            # (13 unchanged attributes hidden)
        }
      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = "vm-131-disk-0"
          + replicate         = true
          + size              = 1
          + ssd               = false
            # (1 unchanged attribute hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:CC:E9:F2" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.module.cloud_image["0"].proxmox_virtual_environment_download_file.image will be created
  + resource "proxmox_virtual_environment_download_file" "image" {
      + checksum            = "7eb9f1480956af75359130cd41ba24419d6fd88d3af990ea9abe97c2f9459fda"
      + checksum_algorithm  = "sha256"
      + content_type        = "import"
      + datastore_id        = "zssd-files"
      + file_name           = "ubuntu-22.04-server-cloudimg-amd64.qcow2"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/releases/22.04/release-20240207/ubuntu-22.04-server-cloudimg-amd64.img"
      + verify              = true
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-61-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->